{
    "version": "https://jsonfeed.org/version/1",
    "title": "Blogger Tekno",
    "description": "",
    "home_page_url": "https://bloggertekno.com",
    "feed_url": "https://bloggertekno.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Ahsan"
    },
    "items": [
        {
            "id": "https://bloggertekno.com/10-aplikasi-untuk-baca-buku-secara-gratis-dan-legal.html",
            "url": "https://bloggertekno.com/10-aplikasi-untuk-baca-buku-secara-gratis-dan-legal.html",
            "title": "10+ Aplikasi untuk Baca Buku Secara Gratis dan Legal",
            "summary": "Dalam era digital yang terus berkembang, kecintaan pada literatur tidak lagi terbatas pada buku-buku fisik yang menghiasi rak-rak perpustakaan. Kini, dengan teknologi yang semakin canggih,&hellip;",
            "content_html": "<p>Dalam era digital yang terus berkembang, kecintaan pada literatur tidak lagi terbatas pada buku-buku fisik yang menghiasi rak-rak perpustakaan. Kini, dengan teknologi yang semakin canggih, kita memiliki akses tak terbatas ke dunia literasi melalui aplikasi-aplikasi pembaca buku. Dengan sekadar sentuhan jari, dunia kata-kata dan cerita-cerita menanti untuk dijelajahi, memperluas cakrawala bacaan kita tanpa batas ruang dan waktu.</p>\n<p>Namun, dalam lautan aplikasi pembaca buku, terkadang sulit untuk membedakan antara yang gratis dan yang legal. Banyak platform menawarkan buku-buku tanpa izin resmi atau meminta biaya langganan yang mahal untuk mengakses koleksi mereka. Tapi jangan khawatir, karena dalam artikel ini, kita akan mengulas sepuluh aplikasi yang tidak hanya memungkinkan kamu menikmati buku secara gratis, tapi juga legal. Dari klasik sastra hingga novel-novel terbaru, aplikasi-aplikasi ini akan membawa kamu ke dalam dunia kata-kata dengan cara yang aman dan berkualitas.</p>\n<p>Selain memberikan akses yang mudah dan murah ke berbagai macam buku, menggunakan aplikasi baca buku secara gratis dan legal juga memiliki sejumlah manfaat yang tak terbantahkan. Pertama-tama, dengan memanfaatkan aplikasi-aplikasi ini, kamu dapat menghemat uang yang seharusnya kamu keluarkan untuk membeli buku secara fisik atau berlangganan layanan berbayar. Ini adalah pilihan yang ideal bagi mereka yang ingin mengeksplorasi beragam judul tanpa harus mengorbankan anggaran belanja mereka.</p>\n<p>Di samping itu, aplikasi baca buku juga sering kali menawarkan fitur-fitur yang memudahkan pembaca dalam menyesuaikan pengalaman membaca mereka. Misalnya, beberapa aplikasi memiliki opsi untuk mengatur tata letak teks, ukuran font, atau bahkan menandai halaman secara digital. Ini memberi kamu kontrol penuh atas cara kamu menikmati buku, membuat pengalaman membaca menjadi lebih pribadi dan sesuai dengan preferensi individu.</p>\n<p>Dan yang tidak kalah penting, dengan menggunakan aplikasi baca buku secara legal, kamu juga membantu mendukung para penulis, penerbit, dan pencipta karya lainnya. Dengan mengakses buku secara sah, kamu memastikan bahwa karya-karya mereka dihargai dan mereka mendapatkan imbalan yang layak atas usaha kreatif mereka. Dengan demikian, menggunakan aplikasi baca buku secara gratis dan legal tidak hanya memberi manfaat langsung bagi pembaca, tetapi juga memperkuat ekosistem literasi secara keseluruhan.</p>\n<p>Tanpa berlama-lama lagi, berikut ini daftar lebih dari 10 aplikasi yang bisa kamu gunakan untuk membaca buku secara gratis dan legal.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=mam.reader.ipusnas\" target=\"_blank\" rel=\"noopener noreferrer\">1. iPusnas</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/iPusnas.jpg\" alt=\"Baca buku gratis dengan iPusnas \" width=\"1317\" height=\"668\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/iPusnas-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/iPusnas-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/iPusnas-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/iPusnas-lg.webp 1024w\"></figure>\n<p>Aplikasi baca buku gratis dan legal yang pertama adalah iPusnas. iPusnas, singkatan dari Indonesian Publication National Library (Perpustakaan Nasional Penerbitan Indonesia), adalah aplikasi yang menyediakan akses gratis ke ribuan buku digital berkualitas dari berbagai genre. Dikelola oleh Perpustakaan Nasional Republik Indonesia, iPusnas menawarkan koleksi yang luas dan terus berkembang, mulai dari karya sastra klasik hingga buku-buku non-fiksi terkini.</p>\n<p>Dengan lebih dari 1 juta unduhan di Google Play Store hingga saat ini, iPusnas telah menjadi salah satu aplikasi baca buku paling populer di Indonesia. Keberhasilan ini menunjukkan bahwa masyarakat semakin menyadari pentingnya akses literasi yang mudah dan terjangkau. Melalui iPusnas, pengguna dapat dengan mudah menelusuri berbagai judul buku, membacanya secara online atau mengunduhnya untuk dibaca di kemudian hari.</p>\n<p>Selain itu, iPusnas juga menawarkan fitur-fitur tambahan yang memperkaya pengalaman membaca, seperti penanda halaman, fitur zoom, dan kemampuan untuk menandai dan menyimpan buku favorit. Dengan antarmuka yang ramah pengguna dan navigasi yang intuitif, iPusnas menjadikan proses mencari dan membaca buku menjadi menyenangkan dan mudah.</p>\n<p>Secara keseluruhan, iPusnas tidak hanya menjadi sumber bacaan yang berharga bagi masyarakat Indonesia, tetapi juga merupakan contoh nyata dari upaya pemerintah dalam meningkatkan akses literasi di negara ini. Dengan terus mengembangkan dan memperbarui koleksinya, iPusnas diharapkan dapat terus menjadi salah satu pilihan utama bagi pembaca yang mencari buku-buku berkualitas secara gratis dan legal.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=com.appsfoundry.eperpuswl.id.kemendikbud.ri\" target=\"_blank\" rel=\"noopener noreferrer\">2. EPerpusdikbud</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/EPerpusDikbud.jpg\" alt=\"Baca Buku Gratis dan Legal dengan Eperpusdikbud\" width=\"1316\" height=\"666\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/EPerpusDikbud-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/EPerpusDikbud-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/EPerpusDikbud-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/EPerpusDikbud-lg.webp 1024w\"></figure>\n<p>Aplikasi kedua yang bisa digunakan untuk membaca buku secara gratis dan legal adalah ePustaka Digital Kementerian Pendidikan, Kebudayaan, Riset, dan Teknologi (ePersPusDikbud). Aplikasi ini merupakan inisiatif dari Kementerian Pendidikan, Kebudayaan, Riset, dan Teknologi Republik Indonesia yang bertujuan untuk memberikan akses mudah dan gratis kepada berbagai sumber literatur dan referensi pendidikan.<br><br>ePersPusDikbud menyediakan koleksi buku digital yang luas, mencakup berbagai topik mulai dari buku pelajaran, buku referensi, hingga karya-karya sastra dan pengetahuan umum. Pengguna dapat dengan mudah mencari dan menelusuri buku-buku dalam berbagai bahasa, termasuk bahasa Indonesia dan bahasa daerah, sesuai dengan kebutuhan mereka.<br><br>Salah satu keunggulan utama dari ePersPusDikbud adalah adanya fitur-fitur yang didesain khusus untuk mendukung kegiatan belajar-mengajar. Misalnya, aplikasi ini menyediakan kemampuan untuk mengunduh buku-buku secara offline, memungkinkan pengguna untuk mengaksesnya tanpa koneksi internet. Selain itu, terdapat fitur-fitur penanda halaman, pencatatan catatan, dan penandaan teks yang memudahkan pengguna dalam mempelajari dan merujuk kembali ke informasi yang penting.<br><br>Dengan komitmen untuk menyediakan akses literasi yang lebih luas bagi masyarakat Indonesia, ePersPusDikbud menjadi salah satu aplikasi baca buku gratis dan legal yang patut diperhitungkan. Dengan memanfaatkan aplikasi ini, pengguna dapat mengakses ribuan buku digital berkualitas, mendukung proses belajar-mengajar, dan mengembangkan minat literasi di kalangan masyarakat.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=com.appsfoundry.eperpuswl.id.kominfo&amp;hl=id\" target=\"_blank\" rel=\"noopener noreferrer\">3. Ruang Buku Kominfo</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/Ruang-Buku-Kominfo.jpg\" alt=\"Baca Buku Gratis dan Legal dengan Ruang Buku Kominfo\" width=\"1304\" height=\"667\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/Ruang-Buku-Kominfo-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/Ruang-Buku-Kominfo-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/Ruang-Buku-Kominfo-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/Ruang-Buku-Kominfo-lg.webp 1024w\"></figure>\n<p>Aplikasi ketiga yang dapat digunakan untuk membaca buku secara gratis dan legal adalah Ruang Buku Kominfo. Ruang Buku Kominfo adalah aplikasi yang dikelola oleh Kementerian Komunikasi dan Informatika Republik Indonesia yang bertujuan untuk memberikan akses mudah kepada masyarakat untuk membaca buku secara digital.<br><br>Melalui Ruang Buku Kominfo, pengguna dapat menikmati koleksi buku digital yang beragam, mulai dari buku-buku pelajaran, buku referensi, hingga karya sastra dan pengetahuan umum. Aplikasi ini menawarkan berbagai fitur yang memudahkan pengguna dalam menemukan dan membaca buku-buku sesuai dengan minat dan kebutuhan mereka.<br><br>Salah satu keunggulan utama dari Ruang Buku Kominfo adalah adanya fitur-fitur interaktif yang meningkatkan pengalaman membaca. Pengguna dapat dengan mudah menyesuaikan tata letak teks, ukuran font, dan warna latar belakang sesuai dengan preferensi mereka. Selain itu, terdapat fitur-fitur penanda halaman, pencatatan catatan, dan kemampuan untuk menandai teks yang memungkinkan pengguna untuk mengingat dan merujuk kembali ke informasi penting.<br><br>Dengan komitmen untuk meningkatkan literasi digital di Indonesia, Ruang Buku Kominfo menjadi salah satu aplikasi baca buku gratis dan legal yang patut diperhitungkan. Dengan memanfaatkan aplikasi ini, pengguna dapat mengakses ribuan buku digital berkualitas tanpa biaya dan tanpa melanggar hak cipta. Ini merupakan langkah positif dalam memperluas akses literasi di kalangan masyarakat Indonesia dan meningkatkan minat membaca di era digital ini.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=mam.reader.ijakarta&amp;hl=id\" target=\"_blank\" rel=\"noopener noreferrer\">4. iJakarta</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/iJakarta.jpg\" alt=\"Baca Buku Gratis dan Legal dengan iJakarta\" width=\"1307\" height=\"664\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/iJakarta-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/iJakarta-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/iJakarta-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/iJakarta-lg.webp 1024w\"></figure>\n<p>Aplikasi keempat dalam daftar ini adalah iJakarta. iJakarta adalah sebuah aplikasi yang dikelola oleh Pemerintah Provinsi DKI Jakarta yang memberikan akses kepada masyarakat untuk membaca buku secara digital secara gratis dan legal.<br><br>Melalui iJakarta, pengguna dapat menjelajahi beragam koleksi buku digital yang mencakup berbagai topik mulai dari sejarah dan budaya Jakarta, hingga berbagai aspek kehidupan dan pembangunan di ibu kota Indonesia. Aplikasi ini menyediakan berbagai fitur yang memudahkan pengguna dalam menemukan dan membaca buku-buku sesuai dengan minat dan kebutuhan mereka.<br><br>Salah satu keunggulan utama dari iJakarta adalah fokusnya pada konten lokal yang relevan dengan masyarakat Jakarta. Pengguna dapat menemukan buku-buku yang memuat informasi sejarah, budaya, dan berbagai aspek kehidupan kota Jakarta, yang merupakan nilai tambah bagi mereka yang ingin lebih memahami dan mengapresiasi warisan budaya dan sejarah kota ini.<br><br>Dengan memanfaatkan iJakarta, pengguna tidak hanya dapat mengakses buku-buku digital secara gratis dan legal, tetapi juga dapat meningkatkan pemahaman mereka tentang Jakarta sebagai ibu kota negara. Ini merupakan langkah positif dalam memperluas literasi lokal dan mempromosikan apresiasi terhadap budaya dan sejarah Jakarta di kalangan masyarakat.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=mam.reader.ijabar&amp;hl=in\" target=\"_blank\" rel=\"noopener noreferrer\">5. iJabar</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/iJabar.jpg\" alt=\"Baca Buku Gratis dan Legal dengan iJabar\" width=\"1306\" height=\"665\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/iJabar-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/iJabar-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/iJabar-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/iJabar-lg.webp 1024w\"></figure>\n<p>Aplikasi selanjutnya dalam daftar ini adalah iJabar. iJabar adalah sebuah aplikasi yang dikelola oleh Pemerintah Provinsi Jawa Barat yang memberikan akses kepada masyarakat untuk membaca buku secara digital secara gratis dan legal.<br><br>Melalui iJabar, pengguna dapat menikmati koleksi buku digital yang beragam, mencakup berbagai topik mulai dari sejarah, budaya, pendidikan, hingga karya sastra dan pengetahuan umum yang relevan dengan Jawa Barat. Aplikasi ini menyediakan berbagai fitur yang memudahkan pengguna dalam menemukan dan membaca buku-buku sesuai dengan minat dan kebutuhan mereka.<br><br>Salah satu keunggulan utama dari iJabar adalah fokusnya pada konten lokal yang berkaitan dengan masyarakat dan budaya Jawa Barat. Pengguna dapat menemukan buku-buku yang membahas berbagai aspek kehidupan, kebudayaan, dan sejarah provinsi Jawa Barat, yang menjadi nilai tambah bagi mereka yang ingin lebih memahami dan mengapresiasi kekayaan budaya dan sejarah daerah ini.<br><br>Dengan memanfaatkan iJabar, pengguna tidak hanya dapat mengakses buku-buku digital secara gratis dan legal, tetapi juga dapat meningkatkan pemahaman mereka tentang Jawa Barat sebagai salah satu provinsi yang kaya akan budaya dan sejarah. Ini merupakan langkah positif dalam memperluas literasi lokal dan mempromosikan apresiasi terhadap budaya dan sejarah Jawa Barat di kalangan masyarakat.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=mam.reader.ijateng&amp;hl=id\" target=\"_blank\" rel=\"noopener noreferrer\">6. iJateng</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/iJateng.jpg\" alt=\"Baca Buku Gratis dan Legal dengan iJateng\" width=\"1304\" height=\"664\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/iJateng-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/iJateng-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/iJateng-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/iJateng-lg.webp 1024w\"></figure>\n<p>Aplikasi keenam dalam daftar ini adalah iJateng. iJateng adalah sebuah aplikasi yang dikelola oleh Pemerintah Provinsi Jawa Tengah yang memberikan akses kepada masyarakat untuk membaca buku secara digital secara gratis dan legal.<br><br>Melalui iJateng, pengguna dapat menjelajahi beragam koleksi buku digital yang mencakup berbagai topik, mulai dari sejarah, budaya, pendidikan, hingga karya sastra dan pengetahuan umum yang relevan dengan Jawa Tengah. Aplikasi ini menyediakan berbagai fitur yang memudahkan pengguna dalam menemukan dan membaca buku-buku sesuai dengan minat dan kebutuhan mereka.<br><br>Salah satu keunggulan utama dari iJateng adalah fokusnya pada konten lokal yang berkaitan dengan masyarakat dan budaya Jawa Tengah. Pengguna dapat menemukan buku-buku yang membahas berbagai aspek kehidupan, kebudayaan, dan sejarah provinsi Jawa Tengah, yang menjadi nilai tambah bagi mereka yang ingin lebih memahami dan mengapresiasi kekayaan budaya dan sejarah daerah ini.<br><br>Dengan memanfaatkan iJateng, pengguna tidak hanya dapat mengakses buku-buku digital secara gratis dan legal, tetapi juga dapat meningkatkan pemahaman mereka tentang Jawa Tengah sebagai salah satu provinsi yang kaya akan budaya dan sejarah. Ini merupakan langkah positif dalam memperluas literasi lokal dan mempromosikan apresiasi terhadap budaya dan sejarah Jawa Tengah di kalangan masyarakat.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=mam.reader.ijogja&amp;hl=id\" target=\"_blank\" rel=\"noopener noreferrer\">7. iJogja</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/iJogja.jpg\" alt=\"Baca Buku Gratis dan Legal dengan iJogja\" width=\"1297\" height=\"664\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/iJogja-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/iJogja-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/iJogja-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/iJogja-lg.webp 1024w\"></figure>\n<p>Aplikasi selanjutnya yang dapat digunakan untuk membaca buku secara gratis dan legal adalah iJogja. Dikembangkan oleh Pemerintah Provinsi Daerah Istimewa Yogyakarta, iJogja memberikan akses kepada masyarakat untuk menikmati berbagai buku digital dengan mudah dan tanpa biaya. Melalui iJogja, pengguna dapat menjelajahi koleksi buku yang beragam, termasuk buku-buku tentang sejarah, budaya, kearifan lokal, serta topik-topik lain yang relevan dengan kota Yogyakarta dan sekitarnya.<br><br>Aplikasi ini menawarkan berbagai fitur yang memudahkan pengguna dalam menemukan dan membaca buku-buku sesuai dengan minat dan kebutuhan mereka. Selain itu, iJogja juga menekankan konten lokal yang kaya akan budaya dan sejarah Yogyakarta. Dengan demikian, pengguna dapat lebih mendalami dan mengapresiasi kekayaan budaya dan sejarah kota yang menjadi salah satu destinasi wisata terkenal di Indonesia ini.<br><br>Dengan memanfaatkan iJogja, pengguna tidak hanya dapat mengakses buku-buku digital secara gratis dan legal, tetapi juga dapat memperluas wawasan dan pemahaman mereka tentang Yogyakarta. Hal ini dapat menjadi langkah positif dalam memperkuat literasi lokal dan meningkatkan apresiasi terhadap budaya dan sejarah kota ini di kalangan masyarakat lokal maupun global.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=mam.reader.ijatim&amp;hl=in\" target=\"_blank\" rel=\"noopener noreferrer\">8. iJatim</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/iJatim.jpg\" alt=\"Baca Buku Gratis dan Legal dengan iJatim\" width=\"1298\" height=\"662\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/iJatim-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/iJatim-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/iJatim-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/iJatim-lg.webp 1024w\"></figure>\n<p>Aplikasi selanjutnya dalam daftar ini adalah iJatim. Merupakan karya dari Pemerintah Provinsi Jawa Timur, iJatim adalah sebuah platform digital yang memungkinkan akses gratis dan legal terhadap berbagai buku digital. Melalui iJatim, masyarakat dapat menjelajahi ragam koleksi literatur yang mencakup berbagai genre, mulai dari buku-buku sejarah dan budaya lokal, hingga karya sastra dan pengetahuan umum yang relevan dengan Jawa Timur.<br><br>Salah satu aspek yang menonjol dari iJatim adalah keberagaman dan kekayaan konten lokalnya. Aplikasi ini memberikan penekanan khusus pada warisan budaya, sejarah, dan kearifan lokal Jawa Timur, memungkinkan pengguna untuk lebih mendalami dan mengapresiasi kekayaan budaya daerah tersebut. Dengan demikian, iJatim tidak hanya menjadi sarana untuk membaca, tetapi juga menjadi jendela bagi pengguna untuk menjelajahi dan memahami lebih dalam tentang kekayaan budaya Jawa Timur.<br><br>Fitur-fitur yang disediakan oleh iJatim juga sangat mendukung pengalaman membaca pengguna. Mulai dari kemampuan untuk menyimpan dan menandai halaman, hingga fitur pencarian yang memudahkan pengguna untuk menemukan buku-buku yang diminati, iJatim dirancang untuk memberikan pengalaman membaca yang menyenangkan dan efisien bagi penggunanya.<br><br>Dengan demikian, iJatim tidak hanya menjadi sarana untuk mengakses buku secara gratis dan legal, tetapi juga menjadi wadah untuk memperkuat literasi lokal dan meningkatkan kesadaran akan kekayaan budaya Jawa Timur di kalangan masyarakat.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=com.appsfoundry.eperpuswl.id.dispusipbatu&amp;hl=id\" target=\"_blank\" rel=\"noopener noreferrer\">9. e-Book Perpustakaan Kota Batu</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/EBook-Perpustakaan-Kota-Batu.jpg\" alt=\"Baca Buku Gratis dan Legal dengan Ebook Perpustkaan Kota Batu\" width=\"1302\" height=\"664\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/EBook-Perpustakaan-Kota-Batu-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/EBook-Perpustakaan-Kota-Batu-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/EBook-Perpustakaan-Kota-Batu-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/EBook-Perpustakaan-Kota-Batu-lg.webp 1024w\"></figure>\n<p>Selanjutnya, e-Book Perpustakaan Kota Batu hadir sebagai aplikasi yang menawarkan akses mudah dan gratis terhadap berbagai koleksi buku digital. Dikelola oleh Dinas Perpustakaan dan Kearsipan Kota Batu, aplikasi ini memungkinkan pengguna untuk menikmati berbagai judul buku, mulai dari buku-buku pelajaran hingga karya sastra, dengan hanya beberapa kali sentuhan layar.</p>\n<p>Salah satu aspek yang membedakan e-Book Perpustakaan Kota Batu adalah fokusnya pada konten lokal yang menggambarkan kekayaan budaya dan sejarah kota tersebut. Pengguna dapat menjelajahi buku-buku yang mencerminkan warisan budaya dan nilai-nilai lokal Kota Batu, memperkaya pemahaman mereka tentang tempat ini sebagai destinasi budaya yang kaya.</p>\n<p>Dengan fitur-fitur yang ramah pengguna dan antarmuka yang intuitif, e-Book Perpustakaan Kota Batu menjadi pilihan yang menarik bagi mereka yang ingin menggali lebih dalam tentang budaya dan sejarah kota ini melalui literatur digital. Dengan demikian, aplikasi ini tidak hanya menjadi sarana untuk membaca buku secara gratis dan legal, tetapi juga menjadi cermin dari upaya pemerintah lokal dalam memperkuat literasi dan mempromosikan warisan budaya kota Batu kepada masyarakat luas.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=mam.reader.bilibrary&amp;hl=id\" target=\"_blank\" rel=\"noopener noreferrer\">10. iBI Library</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/iBI-Library.jpg\" alt=\"Baca Buku Gratis dan Legal dengan iBI Library\" width=\"1301\" height=\"668\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/iBI-Library-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/iBI-Library-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/iBI-Library-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/iBI-Library-lg.webp 1024w\"></figure>\n<p>Masuk ke daftar sebagai aplikasi berikutnya adalah iBI Library, sebuah platform digital yang menawarkan akses gratis dan legal ke berbagai koleksi buku digital. Dikembangkan oleh Badan Informasi Geospasial, iBI Library tidak hanya menyediakan buku-buku dalam berbagai genre dan topik, tetapi juga menonjolkan kekayaan informasi geospasial dan kartografi. Ini menjadikan aplikasi ini unik karena memberikan pengguna kesempatan untuk menjelajahi dunia melalui sudut pandang yang khas, menggabungkan literasi dengan pemahaman mendalam tentang peta dan geografi.<br><br>Salah satu fitur menarik dari iBI Library adalah kemampuannya untuk menyediakan informasi geospasial yang relevan dalam buku-buku yang disediakan. Ini memungkinkan pengguna untuk lebih memahami konteks geografis dari cerita-cerita atau topik-topik yang mereka baca, memberikan dimensi tambahan dalam pemahaman mereka tentang dunia. Dengan koleksi yang terus diperbarui dan diperluas, iBI Library menjadi sumber daya yang berharga bagi mereka yang tertarik dalam literasi serta dunia geospasial.<br><br>Antarmuka yang ramah pengguna dan fitur-fitur yang intuitif menjadikan iBI Library sebagai aplikasi yang mudah digunakan oleh berbagai kalangan. Pengguna dapat dengan mudah menyesuaikan pengalaman membaca mereka, menandai halaman, menyimpan buku favorit, atau bahkan menelusuri informasi geospasial dengan cepat dan efisien. Dengan demikian, iBI Library tidak hanya menjadi sarana untuk membaca secara gratis dan legal, tetapi juga menjadi jendela yang membuka wawasan tentang dunia kita melalui perspektif yang unik dan menarik.</p>\n<h2><a href=\"https://play.google.com/store/apps/details?id=com.overdrive.mobile.android.libby&amp;hl=id\" target=\"_blank\" rel=\"noopener noreferrer\">11. Libby</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/Libby.jpg\" alt=\"Baca Buku Gratis dan Legal dengan Libby\" width=\"1301\" height=\"664\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/Libby-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/Libby-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/Libby-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/Libby-lg.webp 1024w\"></figure>\n<p>Masuk dalam daftar aplikasi yang patut diperhitungkan adalah Libby, sebuah platform digital yang memungkinkan pengguna untuk mengakses ribuan buku secara gratis dan legal. Dikembangkan oleh OverDrive, Libby menawarkan pengalaman membaca yang unik dengan integrasi perpustakaan lokal. Salah satu aspek yang membuat Libby unik adalah kemampuannya untuk menyediakan akses langsung ke koleksi buku digital dari perpustakaan lokal pengguna. Ini memungkinkan pengguna untuk meminjam dan membaca buku secara digital tanpa harus meninggalkan kenyamanan rumah mereka.<br><br>Libby juga menawarkan berbagai fitur yang memperkaya pengalaman membaca. Dengan antarmuka yang ramah pengguna, pengguna dapat dengan mudah menelusuri koleksi, meminjam buku, menandai halaman, dan bahkan mengatur waktu peminjaman buku. Fitur-fitur ini memberikan fleksibilitas dan kontrol kepada pengguna, memungkinkan mereka untuk menyesuaikan pengalaman membaca sesuai dengan preferensi dan jadwal mereka.<br><br>Salah satu keunggulan utama dari Libby adalah adanya opsi untuk menyinkronkan perpustakaan digital pengguna dengan perpustakaan lokal mereka. Ini memungkinkan pengguna untuk mengakses koleksi buku digital dari berbagai perpustakaan dengan mudah, memperluas pilihan bacaan mereka tanpa harus terbatas oleh batas geografis. Dengan demikian, Libby tidak hanya menjadi sarana untuk membaca buku secara gratis dan legal, tetapi juga menjadi jembatan antara pengguna dan beragam sumber literatur yang tersedia di perpustakaan lokal mereka.</p>\n<h2><a href=\"https://www.gutenberg.org/\" target=\"_blank\" rel=\"noopener noreferrer\">12. Project Gutenberg</a></h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/5/Project-Gutenberg.jpg\" alt=\"Baca Buku Gratis dan Legal dengan Project Gutenberg\" width=\"1303\" height=\"665\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/5/responsive/Project-Gutenberg-xs.webp 300w ,https://bloggertekno.com/media/posts/5/responsive/Project-Gutenberg-sm.webp 480w ,https://bloggertekno.com/media/posts/5/responsive/Project-Gutenberg-md.webp 768w ,https://bloggertekno.com/media/posts/5/responsive/Project-Gutenberg-lg.webp 1024w\"></figure>\n<p>Terakhir dalam daftar, kita punya Project Gutenberg, sebuah sumber daya digital yang unik yang menawarkan akses gratis ke ribuan buku klasik dan domain publik. Berbeda dengan aplikasi baca buku lainnya, Project Gutenberg menonjol karena fokusnya pada karya-karya klasik dan literatur yang telah berada di domain publik, memungkinkan pengguna untuk mengeksplorasi warisan literatur dunia tanpa biaya atau batasan hukum.<br><br>Salah satu aspek yang membuat Project Gutenberg unik adalah keragaman koleksi buku yang ditawarkannya. Dari karya sastra klasik, seperti novel-novel oleh Jane Austen atau Charles Dickens, hingga buku-buku non-fiksi tentang sejarah, sains, dan filosofi, Project Gutenberg memiliki sesuatu untuk setiap pembaca. Pengguna dapat menemukan dan menikmati berbagai karya sastra dan pengetahuan yang telah membentuk dunia literasi kita saat ini, semuanya dalam genggaman mereka.<br><br>Fitur pencarian yang kuat dan antarmuka pengguna yang sederhana membuat pengalaman menjelajahi koleksi Project Gutenberg menjadi menyenangkan dan efisien. Pengguna dapat dengan mudah mencari buku berdasarkan judul, penulis, atau subjek tertentu, memudahkan mereka untuk menemukan buku yang diminati. Selain itu, dengan opsi untuk mengunduh buku dalam berbagai format, pengguna memiliki fleksibilitas untuk membaca di berbagai perangkat sesuai kebutuhan mereka.<br><br>Dengan menggabungkan kekayaan literatur klasik dengan teknologi digital, Project Gutenberg tidak hanya menjadi sumber daya berharga bagi pembaca yang ingin mengeksplorasi karya-karya klasik, tetapi juga menjadi jendela ke masa lalu literatur, memungkinkan pembaca untuk terhubung dengan warisan literer yang telah membentuk peradaban kita.</p>\n<hr>\n<p>Selain yang sudah kami sebutkan di atas, masih ada banyak aplikasi lain yang bisa digunakan untuk membaca buku secara gratis dan legal. Beberapa di antaranya bisa dicek melalui <a href=\"https://play.google.com/store/apps/collection/cluster?gsr=SlBqGDdDcHJlbkNxZENJVVNWUDBYak15dHc9PbICMwoWChJtYW0ucmVhZGVyLmlqYXRlbmcQBxIXCAESEzY1MDI0ODQwODMxOTU0NDY3NzcYAA%3D%3D:S:ANO1ljKsAOU\" target=\"_blank\" rel=\"noopener noreferrer\">link berikut ini</a>.</p>\n<p>Dalam dunia yang semakin terhubung secara digital ini, memiliki akses mudah dan legal ke berbagai buku merupakan suatu keistimewaan yang patut disyukuri. Dari iPusnas yang memperkaya literasi nasional hingga Project Gutenberg yang membawa kita kembali ke akar-akar literatur klasik, setiap aplikasi yang telah kita jelajahi menawarkan sesuatu yang berharga bagi para pembaca.</p>\n<p>Semua ini tidak hanya memperluas cakrawala bacaan kita, tetapi juga memperkuat komitmen untuk mendukung industri literasi dan menghargai karya-karya penulis dan pencipta. Mari terus menjadikan membaca sebagai bagian tak terpisahkan dari kehidupan kita, dan mari kita terus mendukung upaya untuk membuat literasi menjadi hak yang dapat diakses oleh semua orang, di mana pun mereka berada.</p>\n<p> </p>\n<h1 class=\"Fd93Bb ynrBgc xwcR9d\"> </h1>\n<p> </p>",
            "image": "https://bloggertekno.com/media/posts/5/Baca-Buku-Gratis-dan-Legal.jpg",
            "author": {
                "name": "Ahsan"
            },
            "tags": [
                   "software"
            ],
            "date_published": "2024-03-29T08:42:48+07:00",
            "date_modified": "2024-03-29T08:42:48+07:00"
        },
        {
            "id": "https://bloggertekno.com/mengintegrasikan-google-form-ke-banyak-sheet.html",
            "url": "https://bloggertekno.com/mengintegrasikan-google-form-ke-banyak-sheet.html",
            "title": "Mengintegrasikan Google Form ke Banyak Sheet ",
            "summary": "Sebelumnya, saya sudah pernah menjelaskan cara mengintegrasikan Google Form dengan banyak file Spreadsheet. Kali ini, saya akan menjelaskan cara mengintegrasikan Google Form dengan banyak sheet&hellip;",
            "content_html": "<p>Sebelumnya, saya sudah pernah menjelaskan <a href=\"https://bloggertekno.com/mengintegrasikan-google-form-ke-banyak-sheet.html\">cara mengintegrasikan Google Form dengan banyak file Spreadsheet</a>. Kali ini, saya akan menjelaskan cara mengintegrasikan Google Form dengan banyak sheet dalam 1 file. </p>\n<p>Secara umum, cara untuk mengintegrasikan Google Form ke banyak sheet tidak jauh berbeda dengan mengintegrasikan Google Form dengan banyak file Spreadsheet. Yang membedakan hanya kode programnya saja. Jadi, pada tutorial kali ini, saya tidak akan menuliskan langkahnya secara lengkap. Untuk langkahnya mulai dari awal silakan ikuti <a href=\"https://bloggertekno.com/mengintegrasikan-google-form-ke-banyak-sheet.html\">tutorial sebelumnya di sini</a>. Sementara pada tutorial kali ini saya akan langsung menjelaskan kode programnya.</p>\n<p>Seperti yang sudah pernah saya jelaskan, untuk mengintegrasikan Google Form dengan banyak file Spreadsheet, kita bisa menggunakan kode seperti di bawah ini:</p>\n<pre class=\"language-javascript line-numbers\"><code>function onFormSubmit(e) {\n  const itemResponses = e.response.getItemResponses();\n  var responses = e.response.getItemResponses(); // Get the submitted responses\n  \n  // Construct an array of response values\n  var formResponse = responses.map(function(response) {\n    return response.getResponse();\n  });\n\n  // Get the timestamp of the form submission\n  var timestamp = e.response.getTimestamp();\n  \n  // Add timestamp to the beginning of the formResponse array\n  formResponse.unshift(timestamp);\n  \n  // Menampung jawaban pertanyaan kedua untuk digunakan sebagai parameter dalam filtering\n  const pertanyaan_kedua = itemResponses[1].getResponse();\n\n  var second_spreadsheet = SpreadsheetApp.openById('SPREADSHEETID');\n  var second_sheet = second_spreadsheet.getActiveSheet();\n  \n  // Mengecek apakah jawaban pertanyaan kedua adalah \"Opsi 1\", jika ya, maka akan ditambahkan ke file Spreadsheet yang lain, selain pada Spreadsheet utama.\n  if (pertanyaan_kedua === 'Opsi 1') {\n    second_sheet.appendRow(formResponse);\n  }\n}</code></pre>\n<p>Sementara untuk mengintegrasikan Google Form ke banyak sheet dalam 1 file, kita perlu menambahkan pemanggilan nama sheet dan pengkondisian untuk menentukan sheet mana yang akan ditambah datanya. Kurang lebih seperti ini.</p>\n<pre class=\"language-javascript line-numbers\"><code>const ss = SpreadsheetApp.getActiveSpreadsheet();\n\nif (status === 'Student') {\n    ss.getSheetByName('Student_Copy').appendRow(e.values);\n} else {\n    ss.getSheetByName('Staff_copy').appendRow(e.values);\n}</code></pre>\n<p>Dan jika digabungkan mulai dari awal, kode lengkapnya kurang lebihnya adalah sebagai berikut:</p>\n<pre class=\"language-javascript line-numbers\"><code>function onFormSubmit(e) {\n  const itemResponses = e.response.getItemResponses();\n  var responses = e.response.getItemResponses(); // Get the submitted responses\n  \n  // Construct an array of response values\n  var formResponse = responses.map(function(response) {\n    return response.getResponse();\n  });\n\n  // Get the timestamp of the form submission\n  var timestamp = e.response.getTimestamp();\n  \n  // Add timestamp to the beginning of the formResponse array\n  formResponse.unshift(timestamp);\n  \n  // Menampung jawaban pertanyaan kedua untuk digunakan sebagai parameter dalam filtering\n  const pertanyaan_kedua = itemResponses[1].getResponse();\n\n  // Menampung file spreadsheet yang tersambung dengan form\n  const ss = SpreadsheetApp.getActiveSpreadsheet();\n  \n  // Mengecek apakah jawaban pertanyaan kedua adalah \"Opsi 1\", jika ya, tambahkan data ke sheet student. jika tidak, tambahkan data ke sheet staf.\n  if (pertanyaan_kedua === 'Opsi 1') {\n     // Menambah row data pada tab (sheet) yang bernama 'Student_Copy'\n     ss.getSheetByName('Student_Copy').appendRow(formResponse);\n  } else {\n    // Menambah row data pada tab (sheet) yang bernama 'Staff_copy'\n    ss.getSheetByName('Staff_copy').appendRow(formResponse);\n  }\n}</code></pre>\n<p class=\"msg--highlight msg \">Satu yang perlu diperhatikan, agar kode di atas bisa berjalan dengan baik, pastikan dalam file Spreadsheet yang kamu gunakan, ada tab (sheet) dengan nama Student_Copy dan Staff_Copy. Karena jika tidak, maka akan muncul error.</p>\n<p>Demikian tutorial singkat kali ini. Semoga bermanfaat.</p>",
            "image": "https://bloggertekno.com/media/posts/4/Mengintegrasikan-Google-Form-ke-Banyak-Sheet.jpg",
            "author": {
                "name": "Ahsan"
            },
            "tags": [
                   "google form"
            ],
            "date_published": "2024-03-28T11:51:39+07:00",
            "date_modified": "2024-03-28T12:36:21+07:00"
        },
        {
            "id": "https://bloggertekno.com/asus-zenbook-duo-ux8406-dual-monitor-produktivitas-gas-pol.html",
            "url": "https://bloggertekno.com/asus-zenbook-duo-ux8406-dual-monitor-produktivitas-gas-pol.html",
            "title": "ASUS Zenbook DUO (UX8406): Dual Monitor, Produktivitas Gas Pol",
            "summary": "Dahulu, saat saya masih seorang web developer yang baru memulai perjalanan di dunia coding, setiap langkah terasa seperti sebuah perjuangan. Saya seringkali merasa seperti juggler&hellip;",
            "content_html": "<p class=\"dropcap\">Dahulu, saat saya masih seorang web developer yang baru memulai perjalanan di dunia coding, setiap langkah terasa seperti sebuah perjuangan. Saya seringkali merasa seperti <em>juggler</em> yang berusaha menjaga banyak bola di udara sekaligus. Ketika saya mulai menulis kode, saya terbiasa membuka editor teks di satu aplikasi, dan browser untuk melihat hasilnya di aplikasi yang berbeda. Setiap kali saya ingin melihat perubahan yang saya buat, saya harus beralih antara kedua aplikasi itu, dan itu seringkali membuat alur kerja saya terputus.</p>\n<p>Tidak hanya itu, ketika saya membutuhkan bantuan atas masalah pada kode program yang saya kerjakan, saya harus membuka halaman dokumentasi di aplikasi lain lagi. Begitu juga ketika saya ingin mencari referensi atau ingin mencari solusi atas masalah tertentu, saya harus melompat-lompat antara beberapa tab di browser.</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://bloggertekno.com/media/posts/2/Web-Programming.jpg\" alt=\"Web Programmer\" width=\"1366\" height=\"768\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/2/responsive/Web-Programming-xs.webp 300w ,https://bloggertekno.com/media/posts/2/responsive/Web-Programming-sm.webp 480w ,https://bloggertekno.com/media/posts/2/responsive/Web-Programming-md.webp 768w ,https://bloggertekno.com/media/posts/2/responsive/Web-Programming-lg.webp 1024w\">\n<figcaption >Sumber: dok. pribadi</figcaption>\n</figure>\n<p>Tetapi seiring berjalannya waktu, saya menyadari bahwa hidup saya sebagai programmer bisa jauh lebih mudah dengan menggunakan dua layar monitor. Setelah saya menambahkan layar kedua ke <em>setup</em> yang saya gunakan, segalanya berubah. Saya bisa membuka editor teks di satu layar sementara hasilnya saya tampilkan di layar yang lain. Tidak ada lagi perpindahan antar-aplikasi yang membuat saya kehilangan fokus.</p>\n<p>Dan ketika saya membutuhkan bantuan atau referensi, saya bisa membuka dokumentasi dan halaman web referensi di layar kedua tanpa harus menyembunyikan editor teks tempat di mana saya menuliskan kode program sehingga fokus saya tidak sampai teralihkan. </p>\n<p>Dengan memiliki dua layar, alur kerja saya pun menjadi lebih lancar dan efisien. Saya bisa lebih fokus pada kode program yang saya tulis tanpa terganggu oleh perpindahan aplikasi. Saat saya mulai menulis kode, layar pertama saya menjadi tempat di mana semua magis terjadi. Saya dapat melihat setiap baris kode dengan jelas di satu layar. Dan ketika saya membutuhkan referensi atau dokumentasi, layar kedua yang akan menjalankan tugasnya. <br><br>Berkat penggunaan dua layar monitor tersebut, produktivitas saya semakin meningkat dan kualitas kerja saya pun semakin baik. Sehingga setiap tugas yang menjadi tanggung jawab dari kantor bisa saya selesaikan lebih cepat. Dan saya pun akhirnya punya cukup waktu untuk mengeksplorasi hal-hal baru. Hasilnya, kini selain bekerja penuh waktu secara WFH, saya juga aktif sebagai <a href=\"https://upwork.com/freelancers/saada5\" target=\"_blank\" rel=\"noopener noreferrer\">pekerja lepas di UpWork</a> dan juga sebagai <a href=\"https://www.youtube.com/c/SuksesKuliah\" target=\"_blank\" rel=\"noopener noreferrer\"><em>content creator </em>di channel SuksesKuliah</a>.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/2/Content-Creator-Youtube.jpg\" alt=\"Channel Youtube Sukses Kuliah\" width=\"1316\" height=\"664\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/2/responsive/Content-Creator-Youtube-xs.webp 300w ,https://bloggertekno.com/media/posts/2/responsive/Content-Creator-Youtube-sm.webp 480w ,https://bloggertekno.com/media/posts/2/responsive/Content-Creator-Youtube-md.webp 768w ,https://bloggertekno.com/media/posts/2/responsive/Content-Creator-Youtube-lg.webp 1024w\"><figcaption>Sumber: dok. pribadi</figcaption></figure>\n<p>Tidak jauh berbeda dengan pekerjaan saya sebagai programmer, sebagai content creator, saya seringkali harus melihat referensi, mengedit, dan meneliti topik tertentu. Dengan memiliki dua layar monitor, saya bisa menjalankan proyek kreatif di satu layar sementara layar lainnya digunakan untuk mencari inspirasi atau melakukan editing. Ini memungkinkan saya untuk tetap fokus tanpa terganggu oleh hal-hal lain.</p>\n<p>Ketika kedua layar monitor bekerja dua-duanya, saya merasa seperti memiliki akses ke seluruh dunia digital tanpa harus meninggalkan tempat duduk. Ini bukan hanya tentang produktivitas, tetapi juga tentang kenyamanan dan kualitas hasil kerja. Dengan memiliki dua layar, saya bisa mengeksplorasi kreativitas dengan lebih bebas, sambil tetap menjaga efisiensi dan akurasi dalam setiap tugas.</p>\n<p>Berdasarkan pengalaman saya pribadi, berikut ini adalah beberapa di antara manfaat yang saya rasakan setelah menggunakan setup 2 monitor:</p>\n<ol>\n<li><strong>Lebih produktif.</strong> <br>Dengan layar ganda, saya bisa lebih cepat menyelesaikan pekerjaan karena tidak perlu pindah layar ketika menuliskan kode dan melihat referensi ataupun melihat hasil koding.</li>\n<li><strong>Lebih sedikit error.<br></strong>Saat beralih antara jendela browser dan aplikasi pengolah teks, mudah sekali untuk lupa apa yang sedang saya kerjakan. Tidak mengherankan jika sering terjadi kesalahan karenanya. Maka dari itu, menggunakan dua layar bisa menjadi solusi untuk meminimalisir kesalahan karena layar utama akan tetap menampilkan kode. Sehingga fokus saya pada kode program yang saya kerjakan tidak sampai hilang.</li>\n<li><strong>Bisa lebih produktif saat meeting.</strong> <br>Menggunakan dua layar monitor memungkinkan saya untuk bisa melakukan meeting secara daring dengan lebih efektif. Karena saya dapat tetap membuka referensi data di layar kedua ketika sedang melakukan presentasi dan berbagi layar di layar utama.</li>\n<li><strong>Kemampuan multitasking yang lebih baik.</strong> <br>Setup 2 monitor memungkinkan saya untuk dapat menjalankan beberapa aplikasi atau tugas secara bersamaan tanpa perlu terus-menerus mengalihkan perhatian dari satu tugas ke tugas lainnya.</li>\n<li><strong>Pengalaman kerja yang lebih nyaman.</strong> <br>Dengan lebih banyak ruang kerja visual, saya merasa lebih leluasa dan nyaman saat bekerja dan dapat dengan mudah mengorganisir aplikasi dan dokumen yang sedang digunakan tanpa merasa dibatasi oleh ruang layar yang terbatas.</li>\n<li><strong>Peningkatan kreativitas dan eksplorasi ide.</strong> <br>Dua layar monitor memberikan saya lebih banyak fleksibilitas untuk mengeksplorasi ide-ide baru dan mengembangkan proyek-proyek dengan lebih bebas.</li>\n<li><strong>Penghematan waktu dan tenaga.</strong> <br>Dengan dua layar monitor, saya dapat mengakses informasi atau aplikasi yang dibutuhkan dengan lebih cepat dan mudah.</li>\n</ol>\n<p class=\"msg msg--info\">Jadi, jika ada yang bertanya apakah memiliki dua layar itu benar-benar berarti, jawaban saya pasti: Ya, itu adalah perbedaan antara memiliki pandangan sempit dan melihat dunia dengan lebih luas. Dan itu sejalan dengan beberapa penelitian yang pernah dilakukan mengenai dual monitor dan produktivitas.</p>\n<h2>Menggunakan Dua Layar Monitor Bisa Meningkatkan Produktivitas Hingga 42%</h2>\n<p>Berdasarkan <a href=\"https://www.jonpeddie.com/news/jon-peddie-research-multiple-displays-can-increase-productivity-by-42/\" target=\"_blank\" rel=\"noopener noreferrer\">hasil penelitian dari Jon Peddie Research</a>, disebutkan bahwa memiliki <em>multiple displays</em> dapat meningkatkan produktivitas hingga 42%. Ini persis seperti yang saya rasakan sendiri setelah menambahkan layar kedua. Sebelumnya, saya sering kali merasa terganggu oleh perpindahan antar-aplikasi dan tab yang memakan waktu, namun dengan penambahan layar kedua, saya dapat mengalokasikan tugas-tugas yang berbeda ke masing-masing layar sehingga proses kerja saya menjadi lebih efektif dan efisien.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/2/Meningkatkan-Produktivitas-dengan-Dua-Layar-Monitor.png\" alt=\"Layar Monitor Ganda Meningkatkan Produktivitas\" width=\"500\" height=\"500\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/2/responsive/Meningkatkan-Produktivitas-dengan-Dua-Layar-Monitor-xs.webp 300w ,https://bloggertekno.com/media/posts/2/responsive/Meningkatkan-Produktivitas-dengan-Dua-Layar-Monitor-sm.webp 480w ,https://bloggertekno.com/media/posts/2/responsive/Meningkatkan-Produktivitas-dengan-Dua-Layar-Monitor-md.webp 768w ,https://bloggertekno.com/media/posts/2/responsive/Meningkatkan-Produktivitas-dengan-Dua-Layar-Monitor-lg.webp 1024w\"></figure>\n<p>Sementara itu, <a href=\"https://collections.lib.utah.edu/details?id=214166\" target=\"_blank\" rel=\"noopener noreferrer\">hasil penelitian yang diungkapkan dalam koleksi University of Utah</a> juga menunjukkan bahwa penggunaan <em>multiple displays</em> dapat meningkatkan produktivitas dan kualitas kerja.</p>\n<p>Kedua penelitian tersebut menegaskan bahwa memiliki bekerja dengan 2 layar monitor memang dapat memberikan manfaat besar dalam hal produktivitas dan kualitas kerja. Pengalaman saya sebagai seorang web developer selama menggunakan dua layar monitor pun sejalan dengan temuan-temuan tersebut. Maka dari itu, saya sangat merekomendasikan kepada siapa pun yang bekerja di dunia digital untuk mempertimbangkan penambahan layar monitor guna meningkatkan efisiensi dan kualitas kerja mereka.</p>\n<h2>Apresiasi Terhadap ASUS Zenbook DUO (UX8406)</h2>\n<p>Berangkat dari berbagai pengalaman saya selama ini, saya sangat mengapresiasi langkah Asus untuk menghadirkan produk ASUS Zenbook DUO (UX8406) yang memiliki dua layar monitor dengan kualitas yang sangat istimewa. Produk ini tampaknya dirancang dengan memahami kebutuhan para profesional digital yang mengandalkan efisiensi dan produktivitas dalam pekerjaan sehari-hari.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/2/Asus-Zenbook-Duo-UX8406-Versatility.jpg\" alt=\"Laptop Revolusioner\" width=\"1161\" height=\"383\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Versatility-xs.webp 300w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Versatility-sm.webp 480w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Versatility-md.webp 768w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Versatility-lg.webp 1024w\"></figure>\n<p>ASUS Zenbook DUO (UX8406) sendiri merupakan hasil evolusi dari proyek ambisius yang dimulai dengan Project Precog, sebuah konsep inovatif yang pertama kali dipamerkan di Computex 2018. Pada saat itu, Project Precog masih dalam bentuk konsep karena ekosistem hardware, software, dan sistem operasi belum sepenuhnya siap untuk memaksimalkan potensi penggunaan layar ganda di laptop.</p>\n<p>Meskipun demikian, ASUS tidak menyerah pada visi mereka untuk menciptakan laptop dengan dua layar yang revolusioner. Mereka terus mengembangkan konsep layar ganda di laptop, dengan membawa fitur ScreenPad™ ke laptop ZenBook Pro 15 (UX580) dan kemudian menghadirkan laptop ZenBook Duo (UX481) dan ZenBook Pro Duo (UX581) dengan layar tambahan ScreenPad™ Plus.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/xgFdKYN33fs\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Selama beberapa tahun, ASUS terus menyempurnakan baik hardware maupun software untuk meningkatkan pengalaman pengguna dengan laptop layar ganda. Upaya konsisten ini memungkinkan ASUS untuk meluncurkan Zenbook DUO (UX8406) sebagai laptop layar ganda terbaik di dunia. Produk ini tidak hanya revolusioner dalam desainnya, tetapi juga telah melalui proses pengembangan yang intens dan konsisten selama bertahun-tahun.</p>\n<p class=\"msg msg--highlight \">Maka tidak berlebihan kalau kita menyebut ASUS Zenbook DUO (UX8406) bukanlah hanya sebuah produk, tetapi juga sebuah pencapaian dalam inovasi teknologi laptop yang mewakili dedikasi dan komitmen ASUS untuk terus melampaui batas-batas dalam menciptakan pengalaman komputasi yang lebih baik bagi pengguna di seluruh dunia.</p>\n<h2>ASUS Zenbook DUO (UX8406): Solusi Produktivitas Kerja di Zaman Digital</h2>\n<p>Dengan dua layar yang terintegrasi secara mulus dalam satu perangkat, ASUS  Zenbook DUO (UX8406) memungkinkan kita untuk menjalankan aplikasi dan tugas-tugas secara paralel tanpa harus terus-menerus beralih antar-aplikasi. Dengan begitu, kita dapat menjaga alur kerja kita tanpa terganggu oleh gangguan visual atau perpindahan antar-jendela yang menghambat produktivitas.</p>\n<p>Fitur <em>dual screen</em> yang dimiliki oleh ASUS Zenbook DUO (UX8406) memungkinkan kita untuk dengan mudah membagi tugas-tugas antara kedua layar, seperti menulis kode di satu layar sementara menjalankan aplikasi pembantu atau melihat dokumentasi di layar yang lain. Hal ini tidak hanya meningkatkan produktivitas, tetapi juga memungkinkan kita untuk tetap fokus pada pekerjaan utama tanpa harus meninggalkan jendela atau aplikasi yang sedang kita gunakan.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/2/Asus-Zenbook-Duo-UX8406-Productivity.png\" alt=\"Lebih Produktif dengan Asus Zenbook Duo UX8406\" width=\"800\" height=\"800\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Productivity-xs.webp 300w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Productivity-sm.webp 480w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Productivity-md.webp 768w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Productivity-lg.webp 1024w\"></figure>\n<h2>ASUS Zenbook DUO (UX8406): Solusi Perbedaan Kualitas Warna Pada Setup Layar Ganda</h2>\n<p>Selain itu, ASUS Zenbook DUO (UX8406) juga memberikan solusi yang sangat diperlukan bagi masalah perbedaan resolusi dan kualitas warna antara layar laptop dan layar eksternal yang biasa kita alami saat menggunakan <em>setup</em> dengan dua layar berbeda. Khususnya jika monitor dan laptopnya berbeda produsen atau memiliki kualitas yang tidak setara.</p>\n<p>Dengan mengintegrasikan dua layar <em>14.0-inch OLED 3K (2880 x 1800) OLED 16:10 aspect ratio 400nits</em> dalam satu perangkat, ASUS Zenbook DUO (UX8406) menjamin konsistensi resolusi dan kualitas warna di seluruh lingkungan kerja. Layar utama dan kedua memiliki spesifikasi resolusi yang sama baiknya, serta dikelola oleh sistem yang terintegrasi dengan baik sehingga menciptakan pengalaman visual yang konsisten.</p>\n<p>Hal ini sangat penting bagi kita yang seringkali harus memantau desain, tampilan, dan warna dari proyek-proyek yang kita kerjakan. Dengan ASUS Zenbook DUO (UX8406), saya yakin bahwa apa pun yang kita lihat di layar utama akan sama persis dengan yang ditampilkan di layar monitor kedua, tanpa ada perbedaan resolusi atau pergeseran warna.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/2/Asus-Zenbook-Duo-UX8406-Screen-Color-Quality.png\" alt=\"Kualitas Layar Terbaik pada Asus Zenbook Duo UX8406\" width=\"600\" height=\"600\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Screen-Color-Quality-xs.webp 300w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Screen-Color-Quality-sm.webp 480w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Screen-Color-Quality-md.webp 768w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Screen-Color-Quality-lg.webp 1024w\"></figure>\n<p>Dengan demikian, Zenbook DUO (UX8406) tidak hanya mengatasi masalah perbedaan resolusi dan kualitas warna yang sering terjadi pada dua setup layar yang berbeda merek, tetapi juga memberikan konsistensi visual yang sangat diperlukan bagi pekerjaan profesional digital. Ini benar-benar merupakan nilai tambah yang besar dan menjadi salah satu alasan mengapa ASUS Zenbook DUO (UX8406) menjadi pilihan ideal bagi mereka yang membutuhkan kinerja tinggi dan konsistensi visual dalam satu perangkat.</p>\n<h2>Produktif di Manapun dengan ASUS Zenbook DUO (UX8406)</h2>\n<p>Yang tidak kalah penting, ASUS Zenbook DUO (UX8406) juga menawarkan tingkat daya tahan yang luar biasa. Laptop konsumen ASUS memenuhi standar militer MIL-STD 810H yang sangat ketat untuk keandalan dan daya tahan, menjalani serangkaian uji yang mencakup tes operasi dalam lingkungan yang keras dan ekstrem. Sehingga cocok untuk di bawa ke mana saja. Bahkan ke lokasi-lokasi yang cukup ekstrem untuk digunakan sebagai tempat kerja.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/2/Asus-Zenbook-Duo-UX8406-Durability.jpg\" alt=\"Durabilitas ASUS Zenbook DUO (2024) UX8406\" width=\"865\" height=\"588\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Durability-xs.webp 300w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Durability-sm.webp 480w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Durability-md.webp 768w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Durability-lg.webp 1024w\"></figure>\n<p>Dengan durabilitasnya yang luar biasa tersebut, ASUS Zenbook DUO (UX8406) juga menjadi solusi ideal untuk tetap produktif di mana pun Anda berada, bahkan saat Anda sedang bepergian atau bekerja dari lokasi yang berbeda-beda. Ditambah dengan kemampuan menggunakan dua layar monitor yang terintegrasi langsung dalam satu perangkat, Anda tidak perlu lagi repot membawa monitor eksternal secara terpisah atau bergantung pada layar laptop tunggal yang mungkin terbatas secara visual.</p>\n<p>Dengan ASUS Zenbook DUO (UX8406), Anda dapat membawa ruang kerja Anda kemanapun pergi, sehingga Anda tidak pernah kehilangan momentum atau kreativitas saat bekerja dalam perjalanan. Apakah Anda sering melakukan perjalanan bisnis? Atau mungkin Anda lebih suka bekerja dari kafe atau ruang coworking? Dengan ASUS Zenbook DUO (UX8406), Anda dapat menyesuaikan lingkungan kerja Anda dengan mudah, tetapi tetap memiliki kemampuan untuk menggunakan dua layar yang luas untuk meningkatkan produktivitas Anda.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/2/Asus-Zenbook-Duo-UX8406-Productivity-Everywhere.png\" alt=\"Produktif di Manapun Bersama ASUS Zenbook DUO (2024) UX8406\" width=\"600\" height=\"600\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Productivity-Everywhere-xs.webp 300w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Productivity-Everywhere-sm.webp 480w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Productivity-Everywhere-md.webp 768w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Productivity-Everywhere-lg.webp 1024w\"></figure>\n<p>Dengan kata lain, Zenbook DUO memungkinkan Anda untuk membawa pengalaman kerja ganda yang efisien dan produktif ke mana pun perjalanan Anda membawa Anda, menjadikannya partner kerja yang sempurna untuk kesuksesan di era kerja yang serba cepat dan dinamis saat ini.</p>\n<h2>Stop Capek Leher dengan ASUS Zenbook DUO (UX8406)</h2>\n<p>ASUS Zenbook DUO (UX8406) juga memberikan solusi yang efektif bagi masalah leher yang sering kita alami ketika menggunakan dua layar dengan ukuran dan setup yang tidak seimbang. Masalah ini seringkali terjadi ketika kita harus terus-menerus mengangkat kepala untuk melihat layar kedua yang ditempatkan di atas atau di samping layar utama.</p>\n<p>Dengan desain layar utama dan layar kedua yang dapat diatur secara vertikal, ASUS Zenbook DUO (UX8406) memungkinkan kita untuk menyesuaikan posisi layar tambahan agar sejajar dengan layar utama.</p>\n<p>Dengan begitu, kita tidak perlu lagi mengangkat atau memiringkan kepala secara berlebihan saat bekerja dengan kedua layar. Karena kita dapat menatanya sedemikian rupa sehingga keduanya berada dalam garis pandang yang nyaman, mengurangi ketegangan pada leher dan bahu.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/2/Asus-Zenbook-Duo-UX8406-Detached.JPG\" alt=\"Asus Zenbook Duo UX8406 Laptop Dua Layar Terbaik\" width=\"600\" height=\"600\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Detached-xs.webp 300w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Detached-sm.webp 480w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Detached-md.webp 768w ,https://bloggertekno.com/media/posts/2/responsive/Asus-Zenbook-Duo-UX8406-Detached-lg.webp 1024w\"></figure>\n<p>Kemampuan untuk mengatur layar secara vertikal ini sangat bermanfaat, terutama saat kita bekerja dalam waktu yang lama atau ketika melakukan tugas yang membutuhkan fokus dan konsentrasi tinggi. Dengan ASUS Zenbook DUO (UX8406), kita dapat bekerja dengan posisi tubuh yang lebih ergonomis dan nyaman, sehingga dapat meningkatkan produktivitas dan mengurangi risiko ketegangan otot yang tidak diinginkan.</p>\n<h2>Siap Menyambut Masa Depan Teknologi AI Bersama ASUS Zenbook DUO (UX8406)</h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/2/Zenbook-DUO-UX8406.jpg\" alt=\"ASUS Zenbook Duo (UX8406)\" width=\"1280\" height=\"720\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/2/responsive/Zenbook-DUO-UX8406-xs.webp 300w ,https://bloggertekno.com/media/posts/2/responsive/Zenbook-DUO-UX8406-sm.webp 480w ,https://bloggertekno.com/media/posts/2/responsive/Zenbook-DUO-UX8406-md.webp 768w ,https://bloggertekno.com/media/posts/2/responsive/Zenbook-DUO-UX8406-lg.webp 1024w\"></figure>\n<p>Hadir dengan sistem operasi Windows 11, ASUS Zenbook DUO (UX8406) juga merupakan laptop berfitur Copilot untuk dukungan AI. Copilot di Windows 11 melengkapi keahlian dan kreativitas Anda dengan bantuan kecerdasan serta jawaban relevan. </p>\n<p>Selain itu, sudah dilengkapi Office Pre-Installed, agar Anda bisa nikmati semua manfaat dengan PC yang lengkap – PC sudah termasuk Office Home &amp; Student 2021. Aplikasi Office versi lengkap (Word, Excel dan PowerPoint) memberikan semua fungsi yang dibutuhkan dan diharapkan oleh penggunanya.</p>\n<p class=\"msg msg--success\">Dan berikut ini adalah spesifikasi lengkap dari ASUS Zenbook DUO (UX8406):</p>\n<table>\n<tbody>\n<tr>\n<td>\n<p><strong>Main Spec.</strong></p>\n</td>\n<td>\n<p><strong>Zenbook DUO (UX8406MA)</strong></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">CPU</span></p>\n</td>\n<td>\n<p><strong>Intel® Core™ Ultra 7 Processor 155H 1.4 GHz (24MB Cache, up to 4.8 GHz, 16 cores, 22 Threads) with Intel® AI Boost NPU</strong></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Operating System</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">Windows 11 Home</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Memory</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">16GB LPDDR5X</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Storage</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">1TB M.2 NVMe™ PCIe® 4.0 Performance SSD</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Display</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">Dual 14-inch ASUS Lumina OLED, 3K (2880 x 1800) 16:10, 120Hz, 0.2ms, 100% DCI-P3, PANTONE Validated, 600nits, VESA CERTIFIED Display HDR True Black 500, Low Blue Light, Anti-Flicker, Touchscreen with Stylus Support</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Graphics</span></p>\n</td>\n<td>\n<p><strong>Intel® Arc™ Graphics</strong></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Input/Output</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">1x USB 3.2 Gen 1 Type-A, 2x Thunderbolt™ 4 supports display / power delivery, 1x HDMI 2.1 TMDS, 1x 3.5mm Combo Audio Jack</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Connectivity</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">Wi-Fi 6E(802.11ax) (Dual band) 2*2 + Bluetooth® 5.3</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Camera</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">FHD camera with IR and Ambient Light Sensor function, support Windows Hello, support Windows Studio Effect</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Audio</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">Smart Amp Technology, Built-in speaker, Built-in array microphone, harman/kardon certified</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Battery</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">75WHrs, 4S1P, 4-cell Li-ion</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Dimension </span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">31.35 x 21.79 x 1.46 ~ 1.99 cm</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Weight</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">1.39 Kg (laptop)</span></p>\n<p><span style=\"font-weight: 400;\">0.3 Kg (keyboard)</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Price</span></p>\n</td>\n<td>\n<p><span style=\"font-weight: 400;\">Rp33.999.000</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"font-weight: 400;\">Warranty</span></p>\n</td>\n<td>\n<p><strong>2 Tahun Garansi Global dan 1 Tahun ASUS VIP Perfect Warranty</strong></p>\n</td>\n</tr>\n</tbody>\n</table>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://bloggertekno.com/media/posts/2/gallery/Asus-Zenbook-Duo-UX8406-Horizontal-Mode-2.jpg\" data-size=\"2400x2400\"><img loading=\"lazy\" src=\"https://bloggertekno.com/media/posts/2/gallery/Asus-Zenbook-Duo-UX8406-Horizontal-Mode-2-thumbnail.webp\" alt=\"ASUS Zenbook DUO (UX8406) Horizontal Mode\" width=\"768\" height=\"768\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://bloggertekno.com/media/posts/2/gallery/Asus-Zenbook-Duo-UX8406-Detachable-Keyboard-2.jpg\" data-size=\"2400x2400\"><img loading=\"lazy\" src=\"https://bloggertekno.com/media/posts/2/gallery/Asus-Zenbook-Duo-UX8406-Detachable-Keyboard-2-thumbnail.webp\" alt=\"ASUS Zenbook DUO (UX8406) Detachable Keyboard\" width=\"768\" height=\"768\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://bloggertekno.com/media/posts/2/gallery/Asus-Zenbook-Duo-UX8406-Dual-Monitor-2.jpg\" data-size=\"2400x2400\"><img loading=\"lazy\" src=\"https://bloggertekno.com/media/posts/2/gallery/Asus-Zenbook-Duo-UX8406-Dual-Monitor-2-thumbnail.webp\" alt=\"ASUS Zenbook DUO (UX8406) Very High Quality\" width=\"768\" height=\"768\"></a></figure>\n</div></div>\n<p>Dengan spesifikasi yang mengagumkan seperti itu, ASUS Zenbook DUO (UX8406) adalah mesin yang tidak hanya kuat, tetapi juga cerdas dan ergonomis. Dilengkapi dengan prosesor Intel® Core™ Ultra 7 yang canggih, memori 16GB LPDDR5X, dan penyimpanan 1TB M.2 NVMe™ PCIe® 4.0 Performance SSD, ASUS Zenbook DUO (UX8406) siap memberikan kinerja tinggi dalam setiap tugas.</p>\n<p>Dual layar 14 inci ASUS Lumina OLED dengan resolusi 3K, 120Hz refresh rate, dan 100% DCI-P3 color gamut memberikan pengalaman visual yang luar biasa, sementara Intel® Arc™ Graphics memastikan kualitas grafis yang mengesankan. Kombinasi konektivitas yang luas, termasuk Thunderbolt™ 4, Wi-Fi 6E, dan Bluetooth® 5.3, memastikan Anda tetap terhubung di mana pun Anda berada.</p>\n<p>Ditambah dengan fitur-fitur tambahan seperti kamera FHD dengan IR dan sensor cahaya ambien untuk Windows Hello, audio harman/kardon certified, dan baterai 75WHrs yang tahan lama, ASUS Zenbook DUO (UX8406) adalah teman ideal untuk meningkatkan produktivitas Anda di era digital ini. Dengan berat yang ringan dan desain yang ergonomis, Anda dapat membawa ASUS Zenbook DUO (UX8406) ke mana pun perjalanan produktivitas Anda membawa Anda, siap untuk menaklukkan setiap tugas dengan percaya diri dan efisiensi.</p>\n<p class=\"msg msg--highlight \"><strong>Dengan fitur-fitur canggih dan desain inovatifnya, ASUS Zenbook DUO (UX8406) adalah katalisator ideal untuk meningkatkan produktivitas kita di era digital ini. </strong> </p>\n<p>Referensi:</p>\n<ul>\n<li><a href=\"https://www.asus.com/laptops/for-home/zenbook/asus-zenbook-duo-2024-ux8406/\">ASUS Zenbook DUO (2024) UX8406｜Laptops For Home｜ASUS Global</a></li>\n<li><a href=\"https://id.store.asus.com/zenbook-duo-ux8406ma-oleds711.html\">Zenbook DUO (UX8406) - UX8406MA-OLEDS711 | ASUS Online Store Indonesia</a></li>\n<li><a href=\"https://channel.asus.com/#/index/ExternalLink?code=f1668629d39e42ea83e14d917c798d6d\">ASUS Channel Site</a></li>\n<li><a href=\"https://www.jonpeddie.com/news/jon-peddie-research-multiple-displays-can-increase-productivity-by-42/\">Jon Peddie Research: Multiple Displays can Increase Productivity by 42% – Jon Peddie Research</a></li>\n<li><a href=\"https://collections.lib.utah.edu/details?id=214166\">Productivity, screens, and aspect ratios | Institutional Repository | J. Willard Marriott Digital Library (utah.edu)</a></li>\n</ul>\n<p> </p>",
            "image": "https://bloggertekno.com/media/posts/2/Asus-Zenbook-Duo.JPG",
            "author": {
                "name": "Ahsan"
            },
            "tags": [
                   "hardware"
            ],
            "date_published": "2024-03-27T11:16:33+07:00",
            "date_modified": "2024-03-28T20:31:27+07:00"
        },
        {
            "id": "https://bloggertekno.com/mengirimkan-form-response-ke-banyak-spreadsheet.html",
            "url": "https://bloggertekno.com/mengirimkan-form-response-ke-banyak-spreadsheet.html",
            "title": "Mengintegrasikan Google Form ke Banyak Spreadsheet",
            "summary": "Google Form merupakan salah satu aplikasi yang paling banyak digunakan dalam mengumpulkan data secara online. Di antara kelebihan Google Form dibandingkan form builder lainnya adalah&hellip;",
            "content_html": "<hr>\n<p>Google Form merupakan salah satu aplikasi yang paling banyak digunakan dalam mengumpulkan data secara online. Di antara kelebihan Google Form dibandingkan form builder lainnya adalah konektivitasnya dengan berbagai macam aplikasi Google yang lain, termasuk Spreadsheet.</p>\n<p>Secara default, masing-masing form yang kita buat itu hanya akan disambungkan dengan satu file Spreadsheet. Masalah akan mulai muncul jika ternyata kita punya kebutuhan untuk membagikan hasil isian form ke banyak orang tanpa ingin membagikan file spreadsheet utama.</p>\n<p>Seperti halnya yang sering terjadi di dunia kerja. Ketika kita punya banyak divisi tapi form yang digunakan hanya satu, maka solusi yang bisa diambil adalah memastikan tiap divisi punya file Spreadsheet secara terpisah agar tidak sampai salah data. Selain <span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">juga untuk memastikan bahwa file Spreadsheet utama hanya bisa diakses oleh orang-orang tertentu.</span></p>\n<p>Buat kamu yang ingin membuat form dan membagikan hasilnya ke banyak orang (banyak Spreadsheet), berikut ini caranya:</p>\n<p>1. Tambahkan Editor Skrip</p>\n<p>Untuk caranya, silakan klik tanda titik tiga yang ada di pojok kanan form, lalu pilih \"Editor Skrip\".</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/1/Tambahkan-Editor-Skrip.jpg\" alt=\"Editor Skrip Google Form\" width=\"1305\" height=\"664\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/1/responsive/Tambahkan-Editor-Skrip-xs.webp 300w ,https://bloggertekno.com/media/posts/1/responsive/Tambahkan-Editor-Skrip-sm.webp 480w ,https://bloggertekno.com/media/posts/1/responsive/Tambahkan-Editor-Skrip-md.webp 768w ,https://bloggertekno.com/media/posts/1/responsive/Tambahkan-Editor-Skrip-lg.webp 1024w\"></figure>\n<p>2. Setelah Muncul Halaman Editor Skip, Masukkan Kode Seperti Berikut</p>\n<pre class=\"language-javascript line-numbers\"><code>function onFormSubmit(e) {\n  const itemResponses = e.response.getItemResponses();\n  var responses = e.response.getItemResponses(); // Get the submitted responses\n  \n  // Construct an array of response values\n  var formResponse = responses.map(function(response) {\n    return response.getResponse();\n  });\n\n  // Get the timestamp of the form submission\n  var timestamp = e.response.getTimestamp();\n  \n  // Add timestamp to the beginning of the formResponse array\n  formResponse.unshift(timestamp);\n  \n  const pertanyaan_kedua = itemResponses[1].getResponse();\n  // var main_spreadsheet = SpreadsheetApp.openById('SPREADSHEETID');\n  // var main_sheet = main_spreadsheet.getActiveSheet();\n  var second_spreadsheet = SpreadsheetApp.openById('SPREADSHEETID');\n  var second_sheet = second_spreadsheet.getActiveSheet();\n\n  if (pertanyaan_kedua === 'Opsi 1') {\n    second_sheet.appendRow(formResponse);\n  }\n  // else {\n  //   main_sheet.appendRow(formResponse);\n  // }\n}</code></pre>\n<p>3. Buat Spreadsheet Baru dan Share Aksesnya dengan Hak Sebagai Editor</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/1/Share-Spreadsheet.jpg\" alt=\"Berbagai Akses Spreadsheet\" width=\"571\" height=\"482\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/1/responsive/Share-Spreadsheet-xs.webp 300w ,https://bloggertekno.com/media/posts/1/responsive/Share-Spreadsheet-sm.webp 480w ,https://bloggertekno.com/media/posts/1/responsive/Share-Spreadsheet-md.webp 768w ,https://bloggertekno.com/media/posts/1/responsive/Share-Spreadsheet-lg.webp 1024w\"></figure>\n<p>4. Sesuaikan ID Spreadsheet yang Sudah Kamu Buat Pada Kode di Atas</p>\n<p>Untuk mendapatkan ID Spreadsheet, caranya adalah dengan mengakses Spreadsheetnya, dan salin kode pada bagian berikut:</p>\n<figure class=\"post__image align-center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/1/Mengambil-ID-Spreadsheet.jpg\" alt=\"Cara Identifikasi ID Spreadsheet\" width=\"907\" height=\"76\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/1/responsive/Mengambil-ID-Spreadsheet-xs.webp 300w ,https://bloggertekno.com/media/posts/1/responsive/Mengambil-ID-Spreadsheet-sm.webp 480w ,https://bloggertekno.com/media/posts/1/responsive/Mengambil-ID-Spreadsheet-md.webp 768w ,https://bloggertekno.com/media/posts/1/responsive/Mengambil-ID-Spreadsheet-lg.webp 1024w\"></figure>\n<p>5. Atur Triggernya</p>\n<p>Langkah selanjutnya yang perlu kamu lakukan adalah mengatur trigger (pemicu), untuk memastikan kapan kode tersebut akan dijalankan. </p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/1/Atur-Trigger.jpg\" alt=\"Mengatur Trigger Google Script\" width=\"424\" height=\"338\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/1/responsive/Atur-Trigger-xs.webp 300w ,https://bloggertekno.com/media/posts/1/responsive/Atur-Trigger-sm.webp 480w ,https://bloggertekno.com/media/posts/1/responsive/Atur-Trigger-md.webp 768w ,https://bloggertekno.com/media/posts/1/responsive/Atur-Trigger-lg.webp 1024w\"></figure>\n<p>6. Sesuaikan Triggernya</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://bloggertekno.com/media/posts/1/Trigger-Form-on-Submit.jpg\" alt=\"Atur Trigger Google Form Script\" width=\"741\" height=\"612\" sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://bloggertekno.com/media/posts/1/responsive/Trigger-Form-on-Submit-xs.webp 300w ,https://bloggertekno.com/media/posts/1/responsive/Trigger-Form-on-Submit-sm.webp 480w ,https://bloggertekno.com/media/posts/1/responsive/Trigger-Form-on-Submit-md.webp 768w ,https://bloggertekno.com/media/posts/1/responsive/Trigger-Form-on-Submit-lg.webp 1024w\"></figure>\n<p>7. Uji Coba</p>\n<p>Setelah pengaturan semuanya selesai. Langkah terakhir adalah uji coba kodenya. Caranya adalah dengan lakukan pengisian pada form sampai selesai dan submit, lalu silakan cek, apakah isian form benar-benar terisi di banyak file Spreadsheet.</p>\n<p>Demikian sedikit tutorial singkat mengenai cara mengirimkan form response ke banyak spreadsheet. Semoga bermanfaat.</p>",
            "image": "https://bloggertekno.com/media/posts/1/Code-for-Multiple-File-Response-Google-Form-Submission.jpg",
            "author": {
                "name": "Ahsan"
            },
            "tags": [
                   "google form"
            ],
            "date_published": "2024-03-26T15:18:21+07:00",
            "date_modified": "2024-03-27T21:33:10+07:00"
        }
    ]
}
